src/main/resources/xml/mtn-refund.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:loc="http://www.csapi.org/schema/parlayx/payment/amount_charging/v2_1/local">
    <soapenv:Header>
        <RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>sp_id</spId>
            <spPassword>sp_password</spPassword>
            <bundleID>256000039</bundleID>
            <timeStamp>time_stamp</timeStamp>
        </RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <loc:refundAmount>
            <loc:endUserIdentifier>end_user_phone_number</loc:endUserIdentifier>
            <loc:charge>
                <description>charge</description>
                <currency>NGN</currency>
                <amount>10000</amount>
                <code>4523</code>
            </loc:charge>
            <loc:referenceCode>225</loc:referenceCode>
        </loc:refundAmount>
    </soapenv:Body>
</soapenv:Envelope>