core/src/main/resources/order_template/oc_chargwithoutiden.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="http://www.csapi.org/schema/parlayx/payment/amount_charging/v2_1/local">
   <soapenv:Header/>
   <soapenv:Body>
      <loc:chargeAmount>
         <loc:endUserIdentifier>{0}</loc:endUserIdentifier>
         <loc:charge>
            <description>{1}</description>
            <!--Optional:-->
            <currency>THB</currency>
            <!--Optional:-->
            <amount>{2}</amount>
            <!--Optional:-->
            <code>1</code>
         </loc:charge>
         <loc:referenceCode>{3}</loc:referenceCode>
      </loc:chargeAmount>
   </soapenv:Body>
</soapenv:Envelope>
