opt_ffs/config/webservices/parlayX_70/AC_chargeAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="http://www.csapi.org/schema/parlayx/payment/amount_charging/v2_1/local">
   <soapenv:Header/>
   <soapenv:Body>
      <loc:chargeAmount>
         <loc:endUserIdentifier>http://some.one</loc:endUserIdentifier>
         <loc:charge>
            <description>description</description>
            <!--Optional-->
            <currency>optional</currency>
            <!--Optional if code carries the information-->
            <amount>3.1415926535897932384626433832795</amount>
            <!--Optional if amount carries the information-->
            <code>code</code>
         </loc:charge>
         <loc:referenceCode>ref_code</loc:referenceCode>
      </loc:chargeAmount>
   </soapenv:Body>
</soapenv:Envelope>